/*

Возводить в степень можно гораздо быстрее, чем за n умножений! Для этого нужно воспользоваться следующими рекуррентными соотношениями:

an = (a2)n/2  при четном n,

an = a × an−1 при нечетном n.

Реализуйте алгоритм быстрого возведения в степень с помощью рекурсивной функции.

Формат входных данных
Вводятся действительное число a и целое неотрицательное число n.

Формат выходных данных
Выведите ответ на задачу.

*/

#include <iostream>
#include <cmath>

double power(double a, int n) {
     if (n == 0) {
        return 1;
    }
   if (n % 2 == 0 )  return power(a*a, n/2);
    else return a*power(a*a,(n-1)/2);
}
int main() {
  // put your code here
    double a = 0;
    int n = 0;
    std::cin >> a >> n;
    std::cout << power(a, n); 
      
 return 0;
}
